const version = [{
  version: "1.0.0",// 版本号
  date: "2018.08.03",// 更新日期
  content: [// 更新描述
    "小程序正式上线啦~~",
    "功能模块共分\"我的小程序\"和\"小程序管理\"两大模块",
    "\"我的小程序\"功能分为\"首页\"、\"关于我们\"、\"产品介绍\"、\"公司通告\"、\"商学院\"五大类",
    "\"小程序管理\"功能分为\"我的小程序\"、\"客户管理\"、\"其他\"三大类",
    "后续我们将陆续完善和添加更多功能，敬请期待...",
    "注：该版本仅供翻阅使用，购买商品、订单操作、余额操作、修改信息等操作请前往\"结算系统\"进行",
  ]
}, {
  version: "1.0.1",// 版本号
  date: "2018.08.08",// 更新日期
  content: [// 更新描述
    "修复图片无法保存的问题",
    "修复视频会同时播放、当滚动出可视页面仍然播放的问题",
    "修复小程序码生成失败的问题",
  ]
}, {
  version: "1.0.2",// 版本号
  date: "2018.08.22",// 更新日期
  content: [// 更新描述
    "添加自动登录功能",
    "添加我的授权书功能",
    "修复时间显示错误的问题",
  ]
}, {
  version: "1.0.3",// 版本号
  date: "2018.08.31",// 更新日期
  content: [// 更新描述
    "添加公司政策功能",
    "添加学习资料功能",
    "优化“产品介绍”、“公司通告”、“商学院”等页面",
    "添加详情页面分享功能",
  ]
}, {
  version: "1.0.4",// 版本号
  date: "2018.09.07",// 更新日期
  content: [// 更新描述
    "添加mp3文件的播放条功能",
    "添加客户案例功能",
    "添加上传案例功能",
    "添加客户案例标签功能",
  ]
}, {
  version: "1.0.5",// 版本号
  date: "2018.09.14",// 更新日期
  content: [// 更新描述
    "部分页面bug修复",
    "添加上传照片功能",
  ]
}, {
  version: "1.0.6",// 版本号
  date: "2018.09.21",// 更新日期
  content: [// 更新描述
    "修复公众号转发为空白的bug",
    "添加客户案例可带搜索转发功能",
    "修复百问百答转发失败的bug",
  ]
}, {
  version: "1.0.7",// 版本号
  date: "2018.09.26",// 更新日期
  content: [// 更新描述
    "添加线上课程功能（目前处于内部测试阶段）",
  ]
}, {
  version: "1.0.8",// 版本号
  date: "2018.09.28",// 更新日期
  content: [// 更新描述
    "添加个人中心余额显示隐藏功能",
    "修复首页公司通告进入出错的bug",
    "修复学习资料分享音频无法打开的bug",
  ]
}, {
  version: "1.1.0",// 版本号
  date: "2018.10.11",// 更新日期
  content: [// 更新描述
    "完善小程序框架",
    "对小程序登录状态进行调整",
  ]
}, {
  version: "1.1.1",// 版本号
  date: "2018.10.23",// 更新日期
  content: [// 更新描述
    "对小程序的的用户安全性进行加强",
    "为课程功能做最后的优化，即将上线",
    "客户案例中添加视频见证功能",
  ]
}, {
  version: "1.1.2",// 版本号
  date: "2018.10.24",// 更新日期
  content: [// 更新描述
    "调整分享给好友时的标题",
    "添加庆典头像功能",
  ]
}, {
  version: "1.1.3",// 版本号
  date: "2018.10.30",// 更新日期
  content: [// 更新描述
    "修复部分用户生成不了庆典头像的bug",
  ]
}, {
  version: "1.1.4",// 版本号
  date: "2018.11.15",// 更新日期
  content: [// 更新描述
    "添加公司介绍分享功能",
    "解决IOS9系统，商学院课程滚不动的bug",
    "解决登录时出现登录失败的bug",
  ]
}, {
  version: "1.1.5",// 版本号
  date: "2018.11.21",// 更新日期
  content: [// 更新描述
    "添加课程分享二维码功能",
  ]
}, {
  version: "1.1.6",// 版本号
  date: "2018.12.10",// 更新日期
  content: [// 更新描述
    "添加周年庆典功能",
    "将原“庆典头像”功能放入至“周年庆典”中",
  ]
}, {
  version: "1.1.7",// 版本号
  date: "2019.1.7",// 更新日期
  content: [// 更新描述
    "添加课程浏览量",
  ]
}]

version.reverse() // 倒叙
module.exports = version