const version = [{
  version: "1.0.0",// 版本号
  date: "2018.07.19",// 更新日期
  content: [// 更新描述
    "小程序正式上线啦~~",
    "功能模块共分\"我的小程序\"和\"小程序管理\"两大模块",
    "\"我的小程序\"功能分为\"首页\"、\"关于我们\"、\"产品介绍\"、\"公司通告\"、\"商学院\"五大类",
    "\"小程序管理\"功能分为\"我的小程序\"、\"客户管理\"、\"其他\"三大类",
    "后续我们将陆续完善和添加更多功能，敬请期待...",
    "注：该版本仅供翻阅使用，购买商品、订单操作、余额操作、修改信息等操作请前往\"结算系统\"进行",
  ]
// },{
//   version: "1.0.1",// 版本号
//   date: "2018.07.19",// 更新日期
//   content: [// 更新描述
//     "更新公告",
//   ]
}]

version.reverse()
module.exports = version